nateihle/AmazonHarmonyIntegration/harmony/v2_06/framework/peripheral/glcd/processor/glcd_p32mz2064dab288.h
/* Created by plibgen $Revision: 1.31 $ */

#ifndef _GLCD_P32MZ2064DAB288_H
#define _GLCD_P32MZ2064DAB288_H

/* Section 1 - Enumerate instances, define constants, VREGs */

#include <xc.h>
#include <stdbool.h>

#include "peripheral/peripheral_common_32bit.h"

/* Default definition used for all API dispatch functions */
#ifndef PLIB_INLINE_API
    #define PLIB_INLINE_API extern inline
#endif

/* Default definition used for all other functions */
#ifndef PLIB_INLINE
    #define PLIB_INLINE extern inline
#endif

typedef enum {

    GLCD_ID_0 = 0,
    GLCD_NUMBER_OF_MODULES = 1

} GLCD_MODULE_ID;

typedef enum {

    GLCD_RGB_MODE_PARALLEL_RGB565 = 0x00000000,
    GLCD_RGB_MODE_PARALLEL_RGB888 = 0x00000001,
    GLCD_RGB_MODE_SERIAL_RGB_3 = 0x00000002,
    GLCD_RGB_MODE_SERIAL_RGBA_4 = 0x00000003,
    GLCD_RGB_MODE_SERIAL_12BIT = 0x00000004,
    GLCD_RGB_MODE_YUYV_16BIT = 0x00000005,
    GLCD_RGB_MODE_BT_656 = 0x00000006

} GLCD_RGB_MODE;

typedef enum {

    GLCD_POLARITY_POSITIVE = 0x00000000,
    GLCD_PIXEL_CLOCK_POLARITY_NEGATIVE = 0x00400000,
    GLCD_DE_POLARITY_NEGATIVE = 0x04000000,
    GLCD_HSYNC_POLARITY_NEGATIVE = 0x08000000,
    GLCD_VSYNC_POLARITY_NEGATIVE = 0x10000000

} GLCD_SIGNAL_POLARITY;

typedef enum {

    GLCD_LAYER_ID_0 = 0x0,
    GLCD_LAYER_ID_1 = 0x1,
    GLCD_LAYER_ID_2 = 0x2,
    GLCD_LAYER_ID_MAX = 0x3

} GLCD_LAYER_ID;

typedef enum {

    GLCD_LAYER_COLOR_MODE_LUT8 = 0x0,
    GLCD_LAYER_COLOR_MODE_RGBA5551 = 0x1,
    GLCD_LAYER_COLOR_MODE_RGBA8888 = 0x2,
    GLCD_LAYER_COLOR_MODE_RGB332 = 0x4,
    GLCD_LAYER_COLOR_MODE_RGB565 = 0x5,
    GLCD_LAYER_COLOR_MODE_ARGB8888 = 0x6,
    GLCD_LAYER_COLOR_MODE_L8 = 0x7,
    GLCD_LAYER_COLOR_MODE_L1 = 0x8,
    GLCD_LAYER_COLOR_MODE_L4 = 0x9,
    GLCD_LAYER_COLOR_MODE_YUYV = 0xA,
    GLCD_LAYER_COLOR_MODE_RGB888 = 0xB

} GLCD_LAYER_COLOR_MODE;

typedef enum {

    GLCD_LAYER_SRC_BLEND_BLACK = 0x0000,
    GLCD_LAYER_SRC_BLEND_WHITE = 0x0100,
    GLCD_LAYER_SRC_BLEND_ALPHA_SRC = 0x0200,
    GLCD_LAYER_SRC_BLEND_ALPHA_GBL = 0x0300,
    GLCD_LAYER_SRC_BLEND_ALPHA_SRCGBL = 0x0400,
    GLCD_LAYER_SRC_BLEND_INV_SRC = 0x0500,
    GLCD_LAYER_SRC_BLEND_INV_GBL = 0x0600,
    GLCD_LAYER_SRC_BLEND_INV_SRCGBL = 0x0700,
    GLCD_LAYER_SRC_BLEND_ALPHA_DST = 0x0A00,
    GLCD_LAYER_SRC_BLEND_INV_DST = 0x0D00

} GLCD_LAYER_SRC_BLEND_FUNC;

typedef enum {

    GLCD_LAYER_DEST_BLEND_BLACK = 0x0000,
    GLCD_LAYER_DEST_BLEND_WHITE = 0x1000,
    GLCD_LAYER_DEST_BLEND_ALPHA_SRC = 0x2000,
    GLCD_LAYER_DEST_BLEND_ALPHA_GBL = 0x3000,
    GLCD_LAYER_DEST_BLEND_ALPHA_SRCGBL = 0x4000,
    GLCD_LAYER_DEST_BLEND_INV_SRC = 0x5000,
    GLCD_LAYER_DEST_BLEND_INV_GBL = 0x6000,
    GLCD_LAYER_DEST_BLEND_INV_SRCGBL = 0x7000,
    GLCD_LAYER_DEST_BLEND_ALPHA_DST = 0xA000,
    GLCD_LAYER_DEST_BLEND_INV_DST = 0xD000

} GLCD_LAYER_DEST_BLEND_FUNC;

typedef enum {

    GLCD_IRQ_TRIGGER_LEVEL = 0x00000000,
    GLCD_IRQ_TRIGGER_EDGE = 0x80000000

} GLCD_IRQ_TRIGGER_CONTROL;

/* Section 2 - Feature variant inclusion */

#define PLIB_TEMPLATE PLIB_INLINE
#include "../templates/glcd_RGBSequentialMode_Default.h"
#include "../templates/glcd_FormattingClockDivideControl_Default.h"
#include "../templates/glcd_YUVOutputControl_Default.h"
#include "../templates/glcd_ForceOutputBlankControl_Default.h"
#include "../templates/glcd_PaletteGammaRampControl_Default.h"
#include "../templates/glcd_SignalPolarityMode_Default.h"
#include "../templates/glcd_SingleCyclePerLineVsyncControl_Default.h"
#include "../templates/glcd_DitheringControl_Default.h"
#include "../templates/glcd_CursorControl_Default.h"
#include "../templates/glcd_EnableControl_Default.h"
#include "../templates/glcd_ClockDivider_Default.h"
#include "../templates/glcd_LinesPrefetch_Default.h"
#include "../templates/glcd_BackgroundColor_Default.h"
#include "../templates/glcd_ResolutionXY_Default.h"
#include "../templates/glcd_FrontPorchXY_Default.h"
#include "../templates/glcd_BlankingXY_Default.h"
#include "../templates/glcd_BackPorchXY_Default.h"
#include "../templates/glcd_CursorXY_Default.h"
#include "../templates/glcd_LayerColorMode_Default.h"
#include "../templates/glcd_LayerSrcBlendFuncMode_Default.h"
#include "../templates/glcd_LayerDestBlendFuncMode_Default.h"
#include "../templates/glcd_LayerGlobalAlpha_Default.h"
#include "../templates/glcd_LayerPreMultiplyImageAlphaControl_Default.h"
#include "../templates/glcd_LayerForceWithGlobalAlphaControl_Default.h"
#include "../templates/glcd_LayerBilinearFilterControl_Default.h"
#include "../templates/glcd_LayerControl_Default.h"
#include "../templates/glcd_LayerStartXY_Default.h"
#include "../templates/glcd_LayerSizeXY_Default.h"
#include "../templates/glcd_LayerBaseAddress_Default.h"
#include "../templates/glcd_LayerStride_Default.h"
#include "../templates/glcd_LayerResXY_Default.h"
#include "../templates/glcd_HSyncInterruptControl_Default.h"
#include "../templates/glcd_VSyncInterruptControl_Default.h"
#include "../templates/glcd_IRQTriggerControl_Default.h"
#include "../templates/glcd_VerticalBlankingActiveState_Default.h"
#include "../templates/glcd_DESignalLevel_Default.h"
#include "../templates/glcd_HSyncSignalLevel_Default.h"
#include "../templates/glcd_VSyncSignalLevel_Default.h"
#include "../templates/glcd_LastRowState_Default.h"
#include "../templates/glcd_GlobalColorLUT_Default.h"
#include "../templates/glcd_CursorData_Default.h"
#include "../templates/glcd_CursorLUT_Default.h"

/* Section 3 - PLIB dispatch function definitions */

PLIB_INLINE_API bool PLIB_GLCD_ExistsRGBSequentialMode(GLCD_MODULE_ID index)
{
     return GLCD_ExistsRGBSequentialMode_Default(index);
}

PLIB_INLINE_API void PLIB_GLCD_RGBSequentialModeSet(GLCD_MODULE_ID index, GLCD_RGB_MODE mode)
{
     GLCD_RGBSequentialModeSet_Default(index, mode);
}

PLIB_INLINE_API GLCD_RGB_MODE PLIB_GLCD_RGBSequentialModeGet(GLCD_MODULE_ID index)
{
     return GLCD_RGBSequentialModeGet_Default(index);
}

PLIB_INLINE_API bool PLIB_GLCD_ExistsFormattingClockDivide(GLCD_MODULE_ID index)
{
     return GLCD_ExistsFormattingClockDivide_Default(index);
}

